In [10]:
import pandas as pd
import numpy as np

In [11]:
book = pd.read_csv("BX-Books.csv",sep=";", error_bad_lines=False, encoding='latin-1')

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3063: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [12]:
book.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [13]:
books=book[['ISBN','Book-Title','Book-Author','Year-Of-Publication', 'Publisher']]

In [14]:
#books.rename(columns={'Book-Title':'title','Book-Author':'author','Year-of-Publication':'year','Publisher':'publisher'},inplace=True)
books.rename(columns={'Book-Title':'title','Book-Author':'author','Year-of-Publication':'year','Publisher':'publisher'},inplace=True)

In [15]:
books.head(2)

,ISBN,title,author,Year-Of-Publication,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [16]:
users=pd.read_csv("BX-Users.csv",sep=";",error_bad_lines=False,encoding='latin-1')

In [17]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [18]:
users.rename(columns={'User-ID':'user_id','Location':'location','Age':'age'},inplace=True)

In [19]:
users.head(2)

   user_id                   location   age
0        1         nyc, new york, usa   NaN
1        2  stockton, california, usa  18.0

In [20]:
rating = pd.read_csv("BX-Book-Ratings.csv",sep=';',error_bad_lines=False,encoding='Latin-1')

In [21]:
rating.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [29]:
rating.rename(columns={'User-ID':'user_id','Book-Rating':'rating'},inplace=True)

In [25]:
books.shape

(271360, 5)

In [26]:
users.shape

(278858, 3)

In [27]:
rating.shape

(1149780, 3)

In [30]:
rating.head(2)

   user_id        ISBN  rating
0   276725  034545104X       0
1   276726  0155061224       5

In [32]:
rating['user_id'].value_counts()

11676     13602
198711     7550
153662     6109
98391      5891
35859      5850
          ...
158698        1
17920         1
277135        1
275086        1
187812        1
Name: user_id, Length: 105283, dtype: int64

In [33]:
#unique user rate
rating['user_id'].value_counts().shape

(105283,)

In [34]:
x = rating['user_id'].value_counts()>200

In [37]:
#we are going to use this user rating for recommondation
x[x].shape

(899,)

In [38]:
y = x[x].index

In [39]:
#user id of people who gave rating more than 200 books
y

Int64Index([ 11676, 198711, 153662,  98391,  35859, 212898, 278418,  76352,
            110973, 235105,
            ...
            260183, 155916,  44296,  73681,  59727,  28634, 188951,   9856,
            268622, 274808],
           dtype='int64', length=899)

In [40]:
ratings = rating[rating['user_id'].isin(y)]

In [41]:
ratings.shape

(526356, 3)

In [42]:
ratings.head()

      user_id        ISBN  rating
1456   277427  002542730X      10
1457   277427  0026217457       0
1458   277427  003008685X       8
1459   277427  0030615321       0
1460   277427  0060002050       0

In [43]:
#joining dataframe rating and book
ratings_with_books= ratings.merge(books,on='ISBN')

In [44]:
ratings_with_books.shape

(487671, 7)

In [54]:
number_rating = ratings_with_books.groupby('title')['rating'].count().reset_index()

In [57]:
number_rating.rename(columns={'rating':'No_of_ratings'},inplace=True)

In [58]:
number_rating.head()

                                               title  No_of_ratings
0   A Light in the Storm: The Civil War Diary of ...              2
1                              Always Have Popsicles              1
2               Apple Magic (The Collector's series)              1
3   Beyond IBM: Leadership Marketing and Finance ...              1
4   Clifford Visita El Hospital (Clifford El Gran...              1

In [60]:
final_rating = ratings_with_books.merge(number_rating,on='title')

In [61]:
final_rating.head()

,user_id,ISBN,rating,title,author,Year-Of-Publication,publisher,No_of_ratings
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
1,3363,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
2,11676,002542730X,6,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
3,12538,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
4,13552,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82

In [62]:
final_rating.shape

(487671, 8)

In [ ]:
final_rating = final_rating[final_rating['No_of_ratings']>=50]

book having more than 50 rating and user who rate more than 200 books

In [65]:
final_rating.shape

(61853, 8)

In [67]:
final_rating.drop_duplicates(['user_id','title'],inplace=True)

In [68]:
final_rating.shape

(59850, 8)

create pivot table

In [69]:
book_pivot = final_rating.pivot_table(columns='user_id',index='title',values='rating')

In [71]:
book_pivot.shape

(742, 888)

In [72]:
book_pivot.fillna(0,inplace=True)

In [73]:
book_pivot.head()

user_id,254,2276,2766,2977,3363,3757,4017,4385,6242,6251,...,274004,274061,274301,274308,274808,275970,277427,277478,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1st to Die: A Novel,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2nd Chance,0.0,10.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4 Blondes,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
84 Charing Cross Road,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,10.0,0.0,0.0,0.0,0.0

In [75]:
from scipy.sparse import csr_matrix

In [76]:
book_sparse = csr_matrix(book_pivot)

In [77]:
type(book_sparse)

scipy.sparse.csr.csr_matrix

In [79]:
from sklearn.neighbors import NearestNeighbors

In [81]:
model = NearestNeighbors(algorithm='brute')

In [82]:
model.fit(book_sparse)

NearestNeighbors(algorithm='brute', leaf_size=30, metric='minkowski',
                 metric_params=None, n_jobs=None, n_neighbors=5, p=2,
                 radius=1.0)

In [91]:
distances, suggestions = model.kneighbors(book_pivot.iloc[240,:].values.reshape(1,-1),n_neighbors=6)

In [92]:
suggestions

array([[240, 238, 237, 241, 239, 184]], dtype=int64)

In [93]:
for i in range(len(suggestions)):
    print(book_pivot.index[suggestions[i]])

Index(['Harry Potter and the Prisoner of Azkaban (Book 3)',
       'Harry Potter and the Goblet of Fire (Book 4)',
       'Harry Potter and the Chamber of Secrets (Book 2)',
       'Harry Potter and the Sorcerer's Stone (Book 1)',
       'Harry Potter and the Order of the Phoenix (Book 5)', 'Exclusive'],
      dtype='object', name='title')

In [94]:
distances, suggestions = model.kneighbors(book_pivot.iloc[54,:].values.reshape(1,-1),n_neighbors=6)

In [96]:
suggestions

array([[ 54, 184, 291, 440, 393, 372]], dtype=int64)

In [95]:
for i in range(len(suggestions)):
    print(book_pivot.index[suggestions[i]])

Index(['Animal Farm', 'Exclusive', 'Jacob Have I Loved', 'Second Nature',
       'Pleading Guilty', 'No Safe Place'],
      dtype='object', name='title')

In [113]:
def recommandation(book_name):
    suggestion_list = []
    book = np.where(book_pivot.index==book_name)[0][0]
    distances, suggestions = model.kneighbors(book_pivot.iloc[book,:].values.reshape(1,-1),n_neighbors=6)
    for i in range(len(suggestions)):
        if i!=0:
            print(book_pivot.index[suggestions[i]])
        else:            
            print("suggestion for book are : ",book_pivot.index[suggestions[i]])

In [114]:
recommandation('Animal Farm')

suggestion for book are :  Index(['Animal Farm', 'Exclusive', 'Jacob Have I Loved', 'Second Nature',
       'Pleading Guilty', 'No Safe Place'],
      dtype='object', name='title')